{
  "recipes": [
    {
      "prep": "100",
      "cook": "20",
      "portions": "-",
      "id": 0,
      "loading": true,
      "title": "Buffalo Chicken Sandwiches",
      "ingredients": "* 2 lb of chicken breasts\n* some bread product to put the sandwich on (I used onion rolls)\n* three cloves of garlic\n* about a cup of Frank's Hot Sauce\n* 1/2 of a red onion\n* 2-3 celery stalks\n* 8 oz. of cream cheese\n* blue cheese crumbles\n* a little paprika and/or cumin\n* salt\n* pepper\n",
      "directions": "* mince garlic, chop onion finely, and dice the celery and put over low heat\n  with some olive oil, stirring often\n* while the veggies are cooking a little (not really sauteing or browning\n  hopefully), cube the chicken breast.  Heat through in a large pan.\n* after the chicken is cooking, add the hot sauce and spices to the sauce,\n  and stir through\n* when the chicken is about cooked, turn off the heat on the sauce and add the\n  cream cheese and stir through\n* when all of the cream cheese is blended, and the chicken is done, pour the\n  sauce over the chicken and stir\n* cook for another few minutes to blend the flavors a bit\n* toast the bread if you want, and spoon the chicken mixture over the bread\n  and top with blue cheese crumbles\n"
    },
    {
      "prep": "<script>alert('css');</script>",
      "cook": "20",
      "portions": "-",
      "id": 1,
      "loading": true,
      "title": "Chipotle Black Bean and Rice Stew",
      "ingredients": "* 1 cup white rice\n* 2 (15 ounce) cans black beans\n* 1 cup frozen white corn kernels\n* 1 (32 ounce) carton vegetable stock\n* 2 Knorr Chipotle Bouillon cubes (or 1-2 well-minced canned chipotle peppers)\n* 1 (15 ounce) can diced tomatoes\n* 1 (8 ounce) can tomato sauce\n* 2 celery ribs, chopped\n* 1 cup sweet white onion or white, minced\n* 3 cloves garlic, chopped\n* 2 tsp chili powder\n* 1 tsp ground coriander\n* 1 1/2 tsp cumin\n* 1 bay leaf\n* 2 tbsp olive oil\n",
      "directions": "1. Put a large pot over medium heat.\n2. Put in olive oil and saute your bay leaf, celery, onions, and garlic for\n   about 4 minutes.\n3. Crumble up your chipotle cubes into the pot and add corn as well as 2 cans\n   of undrained black beans.\n4. Add chili powder, cumin, and coriander. Stir this well.\n5. Add in tomato sauce, tomatoes and stock.\n6. Cover the pot and bring to high-heat and a boil.\n7. Now add rice and bring back to a boil again. Then lower heat, cover, and\n   let simmer until the rice is tender.\n"
    },
    {
      "id": 2,
      "title": "Clam Chowder",
      "prep": 30,
      "cook": 60,
      "portions": 10,
      "ingredients": "* 10 cups clam juice\n* 2 pounds baking potatoes, like russets, peeled and diced\n* 4 pounds fresh or frozen clams, shelled and diced\n* 1/4 pound salt pork, diced\n* 2 small onions, diced\n* 1 cup butter\n* 1 cup flour\n* 2 pints half-and-half\n* Salt and pepper\n* Dash hot pepper sauce\n* Dash Worcestershire sauce\n",
      "directions": "Bring the potatoes and the clam juice to the boil. Cook until the potatoes are\ntender, about 10 to 15 minutes. Add the clams and any of their liquid. Cook\nabout 5 minutes. Set aside.\n\nAdd the pork to a saute pan and cook over low heat until rendered. Add the\nonions and cook until transparent. Add the butter and allow it to melt. Add the\nflour and cook until slightly colored. Add a bit more flour if necessary if the\nmixture is too soft. Bring the clams, juice and potatoes back to the boil.\nGradually stir in the cooked roux. Bring to a rolling boil to thicken. Stir\ncontinuously while cooking. Beat the half-and-half and add to the soup. It may\nnot be necessary to use all the half-and-half; the soup should be thick. Adjust\nthe seasoning and add a dash of hot pepper sauce and Worcestershire sauce\nbefore serving.\n"
    },
    {
      "id": 3,
      "title": "Feta and Spinach Turkey Burgers",
      "prep": 30,
      "cook": 60,
      "portions": 10,
      "ingredients": "* 2 lb. ground turkey breast\n* feta cheese\n* spinach\n* ranch dressing packet\n* 2 eggs\n",
      "directions": "For the feta, I recommend either plain feta or one of the flavored ones with basil/tomato in it.\n\nRemove stems from spinach leaves and slice finely.\n\nThe eggs are key to holding the patties together, especially if using very lean turkey breast. You may consider using one part ground turkey breast and one part ground turkey thigh.\n\nMix everything together in a big bowl and form thin patties. You can store these in the fridge if separated by layer with foil or parchment paper. If grilling, ensure that your patties are on foil to avoid them sticking to the grill (due to the low fat content.)\n"
    },
    {
      "id": 4,
      "title": "Gourmet Mac and Cheese",
      "prep": 30,
      "cook": 60,
      "ingredients": "* 2 lbs uncooked spiral tube-shaped pasta\n* 2 teaspoons olive oil\n* 4 tablespoons butter\n* 1/2 cup flour\n* 4 cups whole milk\n* 2 cups whipping cream\n* 6 cups grated cheddar cheese\n* 3 cups crumbled blue cheese, divided (2 containers)\n* 1 1/2 cups crumbled gorgonzola, divided (1 container)\n* salt & freshly ground black pepper or tricolor pepper, to taste\n* few dashes of cayenne\n* minced fresh chives\n",
      "directions": "* Preheat oven to 350 degrees F; butter a couple of baking dishes\n* Cook the pasta according to package directions until tender but still firm to\n  bite, stirring occasionally; drain and set aside (about 8 minutes).\n* While the pasta is cooking, in a large heavy saucepan over medium low heat,\n  melt the olive oil and butter together; add the flour and, stirring\n  constantly, cook for 1 minute (don't let it brown), then gradually whisk in\n  the milk and cream.\n* Simmer mixture until it slightly thickens, whisking occasionally, for 3\n  minutes.\n* Reduce the temperature to low, then gradually stir in the cheddar, gorgozola,\n  and half of the blue cheese and cook, stirring, until the cheese melts.\n* Season to taste with salt, freshly ground pepper, and cayenne (if using).\n* Stir in the cooked pasta, making sure it's well-coated with the sauce.\n* Pour mixture into the buttered baking dish, with bacon and some chives\n* Sprinkle with the reserved crumbled blue cheese, and bake at 350 degrees F\n  for 30 minutes.\n* Sprinkle with the minced chives and serve.\n"
    },
    {
      "id": 5,
      "title": "Kale Chips",
      "portions": 10,
      "ingredients": "* kale\n* a little olive oil\n* kosher salt\n* freshly ground black pepper\n",
      "directions": "Preheat oven to 400 degrees F.\n\nCut off any large stems of the kale and pull off any bad leaves. Mix all\ningredients together in a ziplock bag sheet pan and roast, until crispy. Shake\nthe pan from time to time to brown the kale evenly. Sprinkle with more kosher\nsalt and serve immediately.\n"
    },
    {
      "prep": "<h1>aldlflafs</h1>",
      "cook": "-",
      "portions": "-",
      "id": 6,
      "loading": true,
      "title": " 123123Puccini's Campfire Pizza 3123132",
      "ingredients": "* Pizza crust - we used Boboli thin crust\n* 1/4 of an onion - chopped fine\n* Small jar of orange marmalade\n* Smoked Sausage\n* Pizza cheese\n* Gorgonzola cheese\n* Fresh Rosemary\n",
      "directions": "Preheat oven to 400 degrees F.\n\nCut off any large stems of the kale and pull off any bad leaves. Mix all\ningredients together in a ziplock bag sheet pan and roast, until crispy. Shake\nthe pan from time to time to brown the kale evenly. Sprinkle with more kosher\nsalt and serve immediately.\n"
    },
    {
      "id": 7,
      "title": "Red Beans and Rice",
      "ingredients": "* 1 pound red kidney beans, dry\n* 1 large onion, chopped\n* 1 bell pepper, chopped\n* 5 ribs celery, chopped\n* As much garlic as you like, minced (I like lots, 5 or 6 cloves)\n* 1 large smoked ham hock, 3/4 pound of Creole-style pickle meat (pickled pork), or 3/4 lb. smoked ham, diced, for seasoning\n* 1 to 1-1/2 pounds mild or hot smoked sausage or andouille, sliced on the bias\n* 1/2 to 1 tsp. dried thyme leaves, crushed\n* 1 or 2 bay leaves\n* As many dashes Crystal hot sauce or Tabasco as you like, to taste\n* A few dashes Worcestershire sauce\n* Creole seasoning blend, to taste; OR,\n   * red pepper and black pepper to taste\n* Salt to taste\n* Fresh Creole hot sausage or chaurice, links or patties, grilled or pan-fried, one link or patty per person (optional)\n* Pickled onions (optional)\n",
      "directions": "Soak the beans overnight, if possible. The next day, drain and put fresh water in the pot. (This helps reduce the, um, flatulence factor.) Bring the beans to a rolling boil. Make sure the beans are always covered by water, or they will discolor and get hard. Boil the beans for about 45 - 60 minutes, until the beans are tender but not falling apart. Drain.\n\nWhile the beans are boiling, sauté the Trinity (onions, celery, bell pepper) until the onions turn translucent. Add the garlic and saute for 2 more minutes, stirring occasionally. After the beans are boiled and drained, add the sautéed vegetables to the beans, then add the ham hock (or ham or pickle meat), smoked sausage, seasonings, and just enough water to cover.\n\nBring to a boil, then reduce heat to a low simmer. Cook for 2 hours at least, preferably 3, until the whole thing gets nice and creamy. Adjust seasonings as you go along. Stir occasionally, making sure that it doesn't burn and/or stick to the bottom of the pot. (If the beans are old -- say, older than six months to a year -- they won't get creamy. Make sure the beans are reasonably fresh. If it's still not getting creamy, take 1 or 2 cups of beans out and mash them, then return them to the pot and stir.)\n\nIf you can ... let the beans cool, stick them in the fridge, and reheat and serve for dinner the next day. They'll taste a LOT better. When you do this, you'll need to add a little water to get them to the right consistency.\n\nServe generous ladles-ful over hot white long-grain rice, with good French bread and good beer. I also love to serve grilled or broiled fresh Creole hot sausage or chaurice on the side. Do not serve with a canned-beet salad, like my Mom always used to do. (Sorry, Mom ... try something interesting with fresh beets and we'll talk. :^)\n\nI like serving a few small pickled onions with my red beans -- I chop them up and mix them in with the beans. It's great! Why does it taste so good? As my sister's friend (and dyed-in-the-wool New Orleanian) Cherie Valenti would say ... \"It's da vineguh!\"\n"
    },
    {
      "id": 8,
      "title": "Roasted Brussels Sprouts",
      "ingredients": "* 1 1/2 pounds Brussels sprouts\n* 3 tablespoons good olive oil\n* 3/4 teaspoon kosher salt\n* 1/2 teaspoon freshly ground black pepper\n",
      "directions": "\"Preheat oven to 400 degrees F.\n\nCut off the brown ends of the Brussels sprouts and pull off any yellow outer leaves. Mix them in a bowl with the olive oil, salt and pepper. Pour them on a sheet pan and roast for 35 to 40 minutes, until crisp on the outside and tender on the inside. Shake the pan from time to time to brown the sprouts evenly. Sprinkle with more kosher salt ( I like these salty like French fries), and serve immediately.\"\n"
    }
  ]
}